// Malicious Attachment Campaigns
EmailAttachmentInfo
| where Timestamp > ago({LookbackDays}d)
| summarize Recipients=dcount(RecipientEmailAddress) by SHA256
| where Recipients >= 5
| sort by Recipients desc
