{
  "name": "__POLICY_NAME__",
  "description": "Endpoint Detection and Response - Sample Sharing",
  "platforms": "windows10",
  "technologies": "mdm,microsoftSense",
  "roleScopeTagIds": [
    "0"
  ],
  "settings": [
    {
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing",
        "auditRuleInformation": null,
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "6998c81e-2814-4f5e-b492-a6159128a97b"
        },
        "choiceSettingValue": {
          "value": "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "f72c326c-7c5b-4224-b890-0b9b54522bd9",
            "useTemplateDefault": false
          },
          "children": []
        }
      }
    }
  ],
  "templateReference": {
    "templateId": "0385b795-0f2f-44ac-8602-9f65bf6adede_1",
    "templateFamily": "endpointSecurityEndpointDetectionAndResponse",
    "templateDisplayName": "Endpoint detection and response",
    "templateDisplayVersion": "Version 1"
  }
}
