{
  "name": "MDE - Firewall Policy",
  "description": "",
  "platforms": "windows10",
  "technologies": "mdm",
  "roleScopeTagIds": [
    "0"
  ],
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_crlcheck",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "vendor_msft_firewall_mdmstore_global_crlcheck_0",
          "children": []
        }
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_disablestatefulftp",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "vendor_msft_firewall_mdmstore_global_disablestatefulftp_false",
          "children": []
        }
      }
    },
    {
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_enableauditmode",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "vendor_msft_firewall_mdmstore_global_enableauditmode_false",
          "children": []
        }
      }
    },
    {
      "id": "3",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction_1",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction_0",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablelogdroppedpackets",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_enablelogdroppedpackets_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablelogignoredrules",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_enablelogignoredrules_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablelogsuccessconnections",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_enablelogsuccessconnections_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_logfilepath",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "%systemroot%\\system32\\LogFiles\\Firewall\\pfirewall.log"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_logmaxfilesize",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 16834
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_shielded",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_domainprofile_shielded_false",
                "children": []
              }
            }
          ]
        }
      }
    },
    {
      "id": "4",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_enablepacketqueue",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "value": "vendor_msft_firewall_mdmstore_global_enablepacketqueue_0",
            "children": []
          }
        ]
      }
    },
    {
      "id": "5",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_1",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_0",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_logfilepath",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "%systemroot%\\system32\\LogFiles\\Firewall\\pfirewall.log"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_logmaxfilesize",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 16834
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_shielded",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_privateprofile_shielded_false",
                "children": []
              }
            }
          ]
        }
      }
    },
    {
      "id": "6",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_1",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_0",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablelogdroppedpackets",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_enablelogdroppedpackets_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablelogignoredrules",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_enablelogignoredrules_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablelogsuccessconnections",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_enablelogsuccessconnections_false",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_true",
                "children": []
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_logfilepath",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "settingValueTemplateReference": null,
                "value": "%systemroot%\\system32\\LogFiles\\Firewall\\pfirewall.log"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_logmaxfilesize",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "settingValueTemplateReference": null,
                "value": 16834
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_shielded",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "vendor_msft_firewall_mdmstore_publicprofile_shielded_false",
                "children": []
              }
            }
          ]
        }
      }
    },
    {
      "id": "7",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_ipsecexempt",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "value": "vendor_msft_firewall_mdmstore_global_ipsecexempt_0",
            "children": []
          }
        ]
      }
    },
    {
      "id": "8",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_opportunisticallymatchauthsetperkm",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "vendor_msft_firewall_mdmstore_global_opportunisticallymatchauthsetperkm_false",
          "children": []
        }
      }
    },
    {
      "id": "9",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_presharedkeyencoding",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "vendor_msft_firewall_mdmstore_global_presharedkeyencoding_1",
          "children": []
        }
      }
    },
    {
      "id": "10",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_saidletime",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "settingValueTemplateReference": null,
          "value": 300
        }
      }
    },
    {
      "id": "11",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}",
        "settingInstanceTemplateReference": null,
        "auditRuleInformation": null,
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_target",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_target_wsl",
                  "children": [
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                      "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_allowhostpolicymerge",
                      "settingInstanceTemplateReference": null,
                      "auditRuleInformation": null,
                      "choiceSettingValue": {
                        "settingValueTemplateReference": null,
                        "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_allowhostpolicymerge_true",
                        "children": []
                      }
                    },
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                      "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_enablefirewall",
                      "settingInstanceTemplateReference": null,
                      "auditRuleInformation": null,
                      "choiceSettingValue": {
                        "settingValueTemplateReference": null,
                        "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_enablefirewall_true",
                        "children": [
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_allowlocalpolicymerge",
                            "settingInstanceTemplateReference": null,
                            "auditRuleInformation": null,
                            "choiceSettingValue": {
                              "settingValueTemplateReference": null,
                              "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_allowlocalpolicymerge_true",
                              "children": []
                            }
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_defaultinboundaction",
                            "settingInstanceTemplateReference": null,
                            "auditRuleInformation": null,
                            "choiceSettingValue": {
                              "settingValueTemplateReference": null,
                              "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_defaultinboundaction_1",
                              "children": []
                            }
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_defaultoutboundaction",
                            "settingInstanceTemplateReference": null,
                            "auditRuleInformation": null,
                            "choiceSettingValue": {
                              "settingValueTemplateReference": null,
                              "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_domainprofile_defaultoutboundaction_0",
                              "children": []
                            }
                          }
                        ]
                      }
                    },
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                      "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_enableloopback",
                      "settingInstanceTemplateReference": null,
                      "auditRuleInformation": null,
                      "choiceSettingValue": {
                        "settingValueTemplateReference": null,
                        "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_enableloopback_false",
                        "children": []
                      }
                    },
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                      "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_enablefirewall",
                      "settingInstanceTemplateReference": null,
                      "auditRuleInformation": null,
                      "choiceSettingValue": {
                        "settingValueTemplateReference": null,
                        "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_enablefirewall_true",
                        "children": [
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_allowlocalpolicymerge",
                            "settingInstanceTemplateReference": null,
                            "auditRuleInformation": null,
                            "choiceSettingValue": {
                              "settingValueTemplateReference": null,
                              "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_allowlocalpolicymerge_true",
                              "children": []
                            }
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_defaultinboundaction",
                            "settingInstanceTemplateReference": null,
                            "auditRuleInformation": null,
                            "choiceSettingValue": {
                              "settingValueTemplateReference": null,
                              "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_defaultinboundaction_1",
                              "children": []
                            }
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_defaultoutboundaction",
                            "settingInstanceTemplateReference": null,
                            "auditRuleInformation": null,
                            "choiceSettingValue": {
                              "settingValueTemplateReference": null,
                              "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_privateprofile_defaultoutboundaction_0",
                              "children": []
                            }
                          }
                        ]
                      }
                    },
                    {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                      "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_enablefirewall",
                      "settingInstanceTemplateReference": null,
                      "auditRuleInformation": null,
                      "choiceSettingValue": {
                        "settingValueTemplateReference": null,
                        "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_enablefirewall_true",
                        "children": [
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_allowlocalpolicymerge",
                            "settingInstanceTemplateReference": null,
                            "auditRuleInformation": null,
                            "choiceSettingValue": {
                              "settingValueTemplateReference": null,
                              "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_allowlocalpolicymerge_true",
                              "children": []
                            }
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_defaultinboundaction",
                            "settingInstanceTemplateReference": null,
                            "auditRuleInformation": null,
                            "choiceSettingValue": {
                              "settingValueTemplateReference": null,
                              "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_defaultinboundaction_1",
                              "children": []
                            }
                          },
                          {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_defaultoutboundaction",
                            "settingInstanceTemplateReference": null,
                            "auditRuleInformation": null,
                            "choiceSettingValue": {
                              "settingValueTemplateReference": null,
                              "value": "vendor_msft_firewall_mdmstore_hypervvmsettings_{vmcreatorid}_publicprofile_defaultoutboundaction_0",
                              "children": []
                            }
                          }
                        ]
                      }
                    }
                  ]
                }
              }
            ]
          }
        ]
      }
    }
  ],
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  }
}

